//+BAS 23.05.2026 : Вывод на форму элемента данных о ПК контрагента
// Реализовать вывод ПК с ссылкой на соответствующий справочник в ТЧ

Функция ПолучитьСсылкиПККонтрагента(Контрагент)
	МассивСсылок = Новый Массив;
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат МассивСсылок;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Компьютеры.Ссылка КАК СсылкаНаКомпьютер
	|ИЗ
	|	Справочник.АС_КомпьютерыAria КАК Компьютеры
	|ГДЕ
	|	Компьютеры.КонтрагентПК = &Контрагент
	|УПОРЯДОЧИТЬ ПО
	|	Компьютеры.Наименование";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивСсылок.Добавить(Выборка.СсылкаНаКомпьютер);
	КонецЦикла;
	
	Возврат МассивСсылок;
КонецФункции

&НаКлиенте
Процедура ПККонтрагентовВыбор(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ДанныеВыбора <> Неопределено И ТипЗнч(ДанныеВыбора) = Тип("СправочникСсылка.АС_КомпьютерыAria") Тогда
		ПоказатьЗначение(, ДанныеВыбора);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТаблицуПККонтрагентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПККонтрагентовНаСервере()
	Объект.ПККонтрагентов.Очистить();
	
	МассивСсылок = ПолучитьСсылкиПККонтрагента(Объект.Ссылка);
	Для Каждого СсылкаНаКомпьютер Из МассивСсылок Цикл
		НоваяСтрока = Объект.ПККонтрагентов.Добавить();
		НоваяСтрока.ИмяПККонтрагентаТЧ = СсылкаНаКомпьютер;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьТаблицуПККонтрагентовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПККонтрагентаТЧВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ИмяПККонтрагентаТЧ) Тогда
		ПоказатьЗначение(, ТекущиеДанные.ИмяПККонтрагентаТЧ);
	КонецЕсли;
КонецПроцедуры

//-BAS 23.05.2026 : Вывод на форму элемента данных о ПК контрагента

//+BAS 23.05.2026 : Переход по двойному нажатию на строку ТЧ в форму элемента справочника

//-BAS 23.05.2026 : Переход по двойному нажатию на строку ТЧ в форму элемента справочника
