//+BAS 23.05.2026 : Вывод на форму элемента данных о ПК контрагента
// Реализовать вывод ПК с ссылкой на соответствующий справочник в ТЧ

Функция ПолучитьДанныеПККонтрагента(Контрагент)
	ТаблицаПК = Новый ТаблицаЗначений;
	ТаблицаПК.Колонки.Добавить("СсылкаНаКомпьютер");
	ТаблицаПК.Колонки.Добавить("КодКомпьютера");
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат ТаблицаПК;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Компьютеры.Ссылка КАК СсылкаНаКомпьютер,
	|	Компьютеры.Код КАК КодКомпьютера
	|ИЗ
	|	Справочник.АС_КомпьютерыAria КАК Компьютеры
	|ГДЕ
	|	Компьютеры.КонтрагентПК = &Контрагент
	|	И Компьютеры.Активен = ИСТИНА
	|УПОРЯДОЧИТЬ ПО
	|	Компьютеры.Код";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаПК.Добавить();
		НоваяСтрока.СсылкаНаКомпьютер = Выборка.СсылкаНаКомпьютер;
		НоваяСтрока.КодКомпьютера = Выборка.КодКомпьютера;
	КонецЦикла;
	
	Возврат ТаблицаПК;
КонецФункции



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТаблицуПККонтрагентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПККонтрагентовНаСервере()
	Объект.ПККонтрагентов.Очистить();
	
	ДанныеПК = ПолучитьДанныеПККонтрагента(Объект.Ссылка);
	Для Каждого СтрокаПК Из ДанныеПК Цикл
		НоваяСтрока = Объект.ПККонтрагентов.Добавить();
		НоваяСтрока.ИмяПККонтрагентаТЧ = СтрокаПК.СсылкаНаКомпьютер;
		НоваяСтрока.КодПК = СтрокаПК.КодКомпьютера;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьТаблицуПККонтрагентовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПККонтрагентаТЧВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ИмяПККонтрагентаТЧ) Тогда
		ПоказатьЗначение(, ТекущиеДанные.ИмяПККонтрагентаТЧ);
	КонецЕсли;
КонецПроцедуры


//+BAS 23.05.2026 : Переход по двойному нажатию на строку ТЧ в форму элемента справочника

&НаКлиенте
Процедура ПККонтрагентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ИмяПККонтрагентаТЧ) Тогда
		ОткрытьЗначение(ТекущиеДанные.ИмяПККонтрагентаТЧ);
	КонецЕсли;
КонецПроцедуры

//-BAS 23.05.2026 : Переход по двойному нажатию на строку ТЧ в форму элемента справочника

//-BAS 23.05.2026 : Вывод на форму элемента данных о ПК контрагента



