//+BAS 23.05.2026 : Вывод на форму элемента данных о ПК контрагента
// Реализовать вывод ПК с ссылкой на соответствующий справочник в ТЧ

Функция ПолучитьСсылкиПККонтрагента(Контрагент)
	МассивСсылок = Новый Массив;
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат МассивСсылок;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АС_КомпьютерыAria.Ссылка КАК СсылкаНаКомпьютер
	|ИЗ
	|	Справочник.АС_КомпьютерыAria КАК Компьютеры
	|ГДЕ
	|	Компьютеры.КонтрагентПК = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивСсылок.Добавить(Выборка.СсылкаНаКомпьютер);
	КонецЦикла;
	Возврат МассивСсылок;
КонецФункции

&НаКлиенте
Процедура ПККонтрагентовВыбор(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ДанныеВыбора <> Неопределено И ТипЗнч(ДанныеВыбора) = Тип("СправочникСсылка.АС_КомпьютерыAria") Тогда
		ПоказатьЗначение(, ДанныеВыбора);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТаблицуПККонтрагентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПККонтрагентовНаСервере()
	Объект.ИмяПККонтрагентаТЧ.Очистить();
	МассивСсылок = ПолучитьСсылкиПККонтрагента(Объект.Ссылка);
	Для Каждого СсылкаНаКомпьютер Из МассивСсылок Цикл
		НоваяСтрока = Объект.ИмяПККонтрагентаТЧ.Добавить();
		НоваяСтрока.ИмяПК = СсылкаНаКомпьютер;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИмяПККонтрагентаТЧВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ИмяПККонтрагентаТЧ.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ИмяПК) Тогда
		ПоказатьЗначение(, ТекущиеДанные.ИмяПК);
	КонецЕсли;
КонецПроцедуры

//-BAS 23.05.2026 : Вывод на форму элемента данных о ПК контрагента
